app/controllers/api/v1/comments_controller.rb

  def index
    @comments = Comment.all.includes(:user)
---
SELECT "comments".* FROM "comments"

  def create
    @comment = Comment.new(comment_params)
    @comment.user = current_user
    if @comment.save
---
INSERT INTO "comments" ("content", "user_id", "youga_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "This is old comment"], ["user_id", 2], ["youga_id", 2], ["created_at", "2023-09-20 21:10:44.138895"], ["updated_at", "2023-09-20 21:10:44.138895"]]

  def find_comment
      @comment = Comment.find(params[:id])
---
SELECT "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]