app/controllers/api/v1/exercises_controller.rb

SELECT "yogas".* FROM "yogas" WHERE "yogas"."id" IN ($1, $2)  [["id", 5], ["id", 3]]
SELECT "exercises".* FROM "exercises" WHERE "exercises"."user_id" = $1  [["user_id", 5]]
---
  def user_yoga
    exercises = current_user.exercises.includes(:yoga)

INSERT INTO "exercises" ("user_id", "youga_id", "created_at", "updated_at", "status") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["youga_id", 1], ["created_at", "2023-09-26 15:29:03.174461"], ["updated_at", "2023-09-26 15:29:03.174461"], ["status", 0]]
---
  def create
    puts "Params-------------------: #{params.inspect}"
    @exercise = current_user.exercises.build(exercise_params)
    if @exercise.save

DELETE FROM "exercises" WHERE "exercises"."id" = $1  [["id", 1]]
---
  def destroy
    if @exercise.destroy

SELECT "exercises".* FROM "exercises" WHERE "exercises"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def find_exercise
    @exercise = Exercise.find(params[:id])