app/controllers/api/v1/users_controller.rb

  def create
    user = User.new(user_params)
    if user.save
---
INSERT INTO "users" ("email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["email", "maan@example.com"], ["password_digest", "[FILTERED]"], ["created_at", "2023-09-21 11:33:06.747334"], ["updated_at", "2023-09-21 11:33:06.747334"]]