app/controllers/api/v1/yogas_controller.rb

SELECT "yogas".* FROM "yogas"
---
  def index
    @yogas = Yoga.all
    yogas_with_image_urls = @yogas.map { |yoga| yoga.attributes.merge(image_url: yoga.image_url) }

SELECT "comments".* FROM "comments" WHERE "comments"."yoga_id" = $1  [["yoga_id", 1]]
---
  def show
    @comments = @youga.comments.includes(:user)
    comment_data = @comments.map do |comment|

INSERT INTO "yogas" ("name", "description", "duration", "created_at", "updated_at", "video_url", "status") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @youga = Yoga.new(youga_params)
    if @youga.save

SELECT "yogas".* FROM "yogas" WHERE "yogas"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def find_youga
    @youga = Yoga.find(params[:id])